## Chapter3——需求分析

### 一. 需求工程

#### i. 需求获取

1. **FAST**基本原则

   ①在中立的地点举行由开发者和用户出席的会议；

   ②建立准备和参与会议的规则；

   ③建议一个足够正式的议程以便可以进行自由的交流；

   ④一个“协调者”(他可以是用户、开发者或其他外人)来控制会议；

   ⑤使用一种“定义机制”(它可以是工作表、图表、墙上胶黏纸或墙板)；

   ⑥目标是标识问题、提出解决方案的要素、商议不同的方法、以及在有利于完成目标的氛围中刻画出初步的需求。

2. **软件原型**：构建原型的要点是，它应该实现用户看得见的功能(例如屏幕显示或打印报表)，省略目标系统的“隐含”功能(例如修改文件)

#### ii. 需求建模

> 在软件需求分析阶段，所创建的模型，要着重于描述系统要做什么，而不是如何去做。目标软件的模型不应涉及软件实现细节

需求规约的原则:

1. 从现实中分离功能，即描述要“做什么”而不是“怎样实现”
2. 规约必须包括系统运行环境
3. 规约必须允许不完备性并允许扩充, 规约必须局部化和松散耦合

#### iii.需求规格说明

#### iv. 需求验证

> 需求验证目的是要检验需求是否能够反映用户的意愿



### 二. 结构化分析方法

> 一种面向数据流的传统软件开发方法

> 以数据流为中心构建软件的分析模型和设计模型

分为：

- 结构化分析(Structured Analysis 简称SA)

- 结构化设计(Structuresd Design 简称SD)

- 结构化程序设计(Structured Programmin 简称SP)

1. 主要思想：抽象与自顶向下的逐层分解
   (控制复杂性的两个基本手段)

   - 抽象：在每个抽象层次上忽略问题的内部复杂性，只关注整个问题与外界的联系

   - 分解：将问题不断分解为较小的问题，直到每个最底层的问题都足够简单为止

2. 模型的描述

   - 数据字典是模型的核心，它包含了软件使用和产生所有数据的描述
   - 数据流图(DFD)：用于功能建模，描述系统的输入数据流如何经过一系列的加工变换逐步变换成系统的输出数据流。（**att**:  软件系统属于顶层图唯一的加工）
   - 实体—关系图(ER)：用于数据建模，描述数据字典中数据之间的关系

3. 数据流图的分层：顶层图、系统内部（0层）图、各层子图

4. 数据字典：由数据项、数据条目组成

5. 加工逻辑的描述方法：

   - 结构化语言
   - 判定表
   - 判定树



### 三. 面向对象方法学

#### 用例

1. 识别系统边界
2. 识别执行者（actor）
3. 识别用例：用例是在系统中执行的**一系列动作**，这些动作将生成特定**执行者可见**的**价值结果**

建立对象模型 OM的方法：

1. 找出 Class - Object（提取1名词短语）
2. 找出关联（提取动词短语）
3. Unknown---------------------------------------------
4. 确定属性（提取形容词）
5. 识别继承（泛化）关系
6. 反复修改

建立 数据模型DM的方法：

1. 编写脚本
2. 构造状态图
3. 审查状态图

建立功能模型 FM

定义服务

### 四.

